{
    "cv_name": "test12",
    "job_description": "Staff Data Engineer\nTechnology\n“Everything about Asda”\nWe are a values-led organisation. As such we encourage everyone to be open and honest. We work creatively and collaboratively, valuing everyone’s input.\n\nOur collaborative culture, the size of our business and our belief in the empowerment of the individual means opportunities at Asda are abundant.\n\nWe conduct £300m worth of transactions every week. Our website handles over 2 million transactions a month. We have more than 145,000 dedicated Asda colleagues ensuring that our customers are at the heart of everything we do.\n\n“Everything you’ll love”\nMinimum 24 days annual leave per year plus 8 bank holidays – Making sure you take time for your self and switch off\n4 weekly pay – which means you get an extra payday a year\nDigital GP and Wellbeing sessions – Asda genuinely cares so we create a culture where our people can perform at their best, the physical health and mental wellbeing of all our people is very important to us\nDiscount off your shopping at Asda and George - with extra discounts running throughout the year – really makes a difference, saving the colleagues an average of £700 a year\nCareer development and apprenticeship and graduate schemes - we want our colleagues to excel and grow with our business. (Link to grad scheme on Asda page)\nFree city centre parking – you can also use it outside working hours\nPlus, much more!\n\n“That’s more like it”\nLS Eleven is a new Asda division dedicated to the Asda Rewards Digital Loyalty Program, Asda Media Partnerships, Asda Money & Mobile, and Asda Group customer decision science. We are looking for a talented engineer to play a leading role in developing the data products which sit at the heart of Asda’s commercial and data strategies. Leveraging your hands-on coding skills as well as your leadership skills, you’ll be an expert individual contributor while managing and developing a small squad of BI engineers. Most importantly, working closely with the Data Product Lead, you will shape the technical strategy for engineering in LS Eleven.\n\nAs the LS Eleven Staff Data Engineer, you will:\n\nDevelop and implement the technical strategy and vision across the engineering squads and beyond (including how to operationalise products created by our data science colleagues)\nDesign the data architecture for the data products, and collaborate with platform colleagues to design related solution architecture for activation use cases (e.g. integrating products with systems such as the Rewards app CMS)\nCollaborate with data science colleagues to turn ML into scaled, customer-impacting, solutions\nEnsure consistent standards, patterns, and technical processes across the development squads\nCreate tools and processes for financial and performance optimisation\nAct as Subject Matter Expert for Databricks and Azure, staying on top of new features and trends, implementing them into the data products, and coaching the development teams\nLine manage a small team of BI Engineers, ensuring consistent quality\nMentor and develop the lead engineers and data engineers\nFind and implement technical ways to increase simplicity and efficiency, including by creating common data models\nDevelop strong relationships with upstream technology teams and downstream data science and business consumers, ensuring that our data products are developed according to the needs of the business\nAbout You\nWe want all colleagues to be able to bring their best and true selves to work, every day. Simply put, we want our colleagues to be Proud to be Asda and proud to be themselves.\n\nEssential\nEducated to degree level, ideally in a relevant STEM discipline.\nPassion for all corners of data engineering: whether it’s designing a data model, creating a CI/CD pipeline, optimising code, serving a model, or connecting our products to customer-impacting systems, you’re interested in getting the job done.\nDesire to be a hands-on contributor, a people manager, and a strategic thinker.\nYou know what you don’t know, and you’re able to become an expert in something quickly.\nExperience leading or mentoring a high performing team.\nSignificant experience as a data engineer, building productionised big data products in the cloud.\nExcellent PySpark, Databricks, and SQL skills.\nAbility to influence cross-functional, geographically distributed teams.\nExperience working in an agile product development environment.\nExcellent problem-solving, communication, and interpersonal skills.\nStrategic and analytical thinker .\nExcellent initiative and ability to flourish in an open-ended role.\nDesirable\nExperience with ML-related data products such as feature stores, and experience operationalising ML.\nSignificant experience with data modeling.\nExtensive Microsoft Azure experience.\nExperience with Databricks Asset Bundles.\nExperience in, and understanding of, retail, data-driven personalisation, retail media, and loyalty programs.\nStrong understanding of data science concepts.\nExperience with infrastructure as code.\nExperience with AI tooling such as Databricks Genie Rooms.\n\nWork Where it Works\nOur hybrid way of working gives you the choice to work where it works. This enables you to chose where you’ll be the most effective. It offers a mix of working from home and in an office environment that works best for you and your team.\n\nYou will also get an excellent benefits package including; -\n\nDiscretionary company bonus\n£5,700 company car or car allowance\nCompany pension up to 7% matched\n10% colleague discount, free parking and many additional rewards.\nWe want all colleagues to be able to bring their best and true selves to work, every day. Simply put, we want our colleagues to be Proud to be Asda and proud to be themselves"
}